# Taps
tap "git-friendly/git-friendly"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "oven-sh/bun"

# CLI tools
brew "python@3.11" # Required by awscli
brew "awscli" # Official Amazon AWS command-line interface
brew "bat" # Output highlighting (better `cat`)
brew "eza" # Listing files with info (better `ls`)
brew "fastfetch" # Show pretty system info
brew "fd" # Find entries in your filesystem (better `find`)
brew "fnm" # Node.js version manager
brew "fzf" # Fuzzy file finder and filtering
brew "gh" # GitHub CLI: interact with GitHub PRs, issues, repos
brew "git" # Version control
brew "git-delta" # Diff pager for `git` and `grep` output (better `diff`)
brew "htop" # Performance and resource monitoring tool (better `top`)
brew "neovim" # Text editor for terminal
brew "node" # Fallback Node.js version
brew "pnpm" # Efficient Node.js package manager
brew "prettyping" # Prettier and compact `ping`
brew "ripgrep" # Searching within files (better `grep`)
brew "starship" # Prompt manager
brew "tlrc" # Community-maintained docs (better `man`)
brew "trash-cli" # Record and restore removed files (better `rm`)
brew "webp" # More efficient web images
brew "zoxide" # Convenient and majical navigation (better `cd`)
brew "zsh" # A shell of choice
brew "zsh-autosuggestions" # Fish-like autosuggestions for Zsh
brew "zsh-syntax-highlighting" # Fish-like syntax highlighting for Zsh
brew "git-friendly/git-friendly/git-friendly" # Improved Git commands for common tasks
brew "jesseduffield/lazydocker/lazydocker" # Full Docker management app
brew "jesseduffield/lazygit/lazygit" # Full Git management app
brew "oven-sh/bun/bun" # Bun runtime

# Temporarily required for some work projects
brew "libpng"
brew "cairo"
brew "giflib"
brew "jpeg"
brew "pango"
brew "librsvg"
brew "pkg-config"

# GUI apps
cask "1password@7" # Password manager
cask "arc" # Modern browser
cask "coteditor" # Simple code/text editor
cask "insomnia" # API client
cask "keka" # File archiver and extractor
cask "marta" # File manager
cask "obsidian" # Note-taking app
cask "optimage" # Image optimization
cask "rectangle" # Window manager
cask "rocket" # Handy emojis picker
cask "slack" # Messaging social platform
cask "superduper" # Data backup
cask "syntax-highlight", args: { no_quarantine: true } # Preview many different source code files
# cask "visual-studio-code" # Code editor use with dmg
cask "vivaldi" # Browser with built-in privacy
# cask "wezterm" # Better terminal emulator use with dmg

# Fonts
cask "font-symbols-only-nerd-font"
